# 无人机以及机库操作状态汇总v1.5 版本
from BASEUtile.Config import Config

result_code_dict = {
    #
    "9140": "机库门打开成功",
    "9141": "[兼容异常]其他失败或异常",
    "9142": "库门打开失败",
    "9143": "x参数非法，超过阈值",
    "9144": "[预留]",
    "9145": "[预留]",
    "9146": "[预留]",
    "9147": "[预留]",
    "9148": "[预留]",
    "9149": "[预留]",
    "914a": "下位机无法识别命令",
    "914b": "卡住了",
    "914c": "下位机操作链接超时",
    "914d": "底层端口或串口被占用",
    "914e": "上位机内部异常",
    #
    "9150": "机库门关闭成功",
    "9151": "[兼容异常]其他失败或异常",
    "9152": "库门关闭失败",
    "9153": "非固定命令150000",
    "9154": "[预留]",
    "9155": "[预留]",
    "9156": "[预留]",
    "9157": "[预留]",
    "9158": "[预留]",
    "9159": "[预留]",
    "915a": "下位机无法识别命令",
    "915b": "卡住了",
    "915c": "下位机操作链接超时",
    "915d": "底层端口或串口被占用",
    "915e": "上位机内部异常",
    #
    "92a0": "操作上下推拉杠打开成功",
    "92a1": "[兼容异常]其他失败或异常",
    "92aa": "下位机无法识别命令",
    "92ab": "[占用]卡住了",
    "92ac": "下位机操作链接超时",
    "92ad": "底层端口或串口被占用",
    "92ae": "上位机内部异常",
    #
    "92b0": "操作上下推拉杠关闭成功",
    "92b1": "[兼容异常]其他失败或异常",
    "92ba": "下位机无法识别命令",
    "92bb": "[占用]卡住了",
    "92bc": "下位机操作链接超时",
    "92bd": "底层端口或串口被占用",
    "92be": "上位机内部异常",
    #
    "92c0": "操作左右推拉杠打开成功",
    "92c1": "[兼容异常]其他失败或异常",
    "92ca": "下位机无法识别命令",
    "92cb": "[占用]卡住了",
    "92cc": "下位机操作链接超时",
    "92cd": "底层端口或串口被占用",
    "92ce": "上位机内部异常",
    #
    "92d0": "操作左右推拉杠关闭成功",
    "92d1": "[兼容异常]其他失败或异常",
    "92da": "下位机无法识别命令",
    "92db": "[占用]卡住了",
    "92dc": "下位机操作链接超时",
    "92dd": "底层端口或串口被占用",
    "92de": "上位机内部异常",
    #
    "92e0": "XY推杆夹住成功",
    "92e1": "[兼容异常]其他失败或异常",
    "92e2": "上下推杆夹紧失败",
    "92e3": "左右推杆夹紧失败",
    "92e4": "x参数非法，超过阈值",
    "92e5": "y参数非法，超过阈值",
    "92e6": "[预留]",
    "92e7": "[预留]",
    "92e8": "[预留]",
    "92e9": "[预留]",
    "92ea": "下位机无法识别的命令",
    "92eb": "[占用]卡住了",
    "92ec": "下位机操作链接超时",
    "92ed": "底层端口或串口被占用",
    "92ee": "上位机内部异常",
    #
    "92f0": "XY推杆打开成功",
    "92f1": "[兼容异常]其他失败或异常",
    "92f2": "上下推杆打开失败",
    "92f3": "左右推杆打开失败",
    "92f4": "x参数非法，超过阈值",
    "92f5": "y参数非法，超过阈值",
    "92f6": "[预留]",
    "92f7": "[预留]",
    "92f8": "[预留]",
    "92f9": "[预留]",
    "92fa": "下位机无法识别的命令",
    "92fb": "[占用]卡住了",
    "92fc": "下位机操作链接超时",
    "92fd": "底层端口或串口被占用",
    "92fe": "上位机内部异常",
    #
    "9500": "XY推杆复位成功",
    "9501": "[兼容异常]其他失败或异常",
    "9502": "上下推杆复位失败",
    "9503": "左右推杆复位失败",
    "9504": "非固定命令500000",
    "9505": "[预留]",
    "9506": "[预留]",
    "9507": "[预留]",
    "9508": "[预留]",
    "9509": "[预留]",
    "950a": "下位机无法识别的命令",
    "950b": "[占用]卡住了",
    "950c": "下位机操作链接超时",
    "950d": "底层端口或串口被占用",
    "950e": "上位机内部异常",
    #
    "9300": "空调开机成功",
    "9301": "[兼容异常]其他失败或异常",
    "9302": "空调开机失败",
    "9303": "非固定命令300000",
    "930a": "下位机无法识别的命令",
    "930b": "[占用]卡住了",
    "930c": "下位机操作链接超时",
    "930d": "底层端口或串口被占用",
    "930e": "上位机内部异常",
    #
    "9310": "空调关机成功",
    "9311": "[兼容异常]其他失败或异常",
    "9312": "空调关机失败",
    "9313": "非固定命令310000",
    "931a": "下位机无法识别的命令",
    "931b": "[占用]卡住了",
    "931c": "下位机操作链接超时",
    "931d": "底层端口或串口被占用",
    "931e": "上位机内部异常",
    #
    "9400": "手柄开成功",
    "9401": "[兼容异常]其他失败或异常",
    "9402": "手柄开失败",
    "9403": "非固定命令400000",
    "940a": "下位机无法识别的命令",
    "940b": "[占用]卡住了",
    "940c": "下位机操作链接超时",
    "940d": "底层端口或串口被占用",
    "940e": "上位机内部异常",
    #
    "9410": "手柄关成功",
    "9411": "[兼容异常]其他失败或异常",
    "9412": "手柄关失败",
    "9413": "非固定命令400000",
    "941a": "下位机无法识别的命令",
    "941b": "[占用]卡住了",
    "941c": "下位机操作链接超时",
    "941d": "底层端口或串口被占用",
    "941e": "上位机内部异常",
    #
    "9dt0": "开机成功",
    "9dt1": "[兼容异常]其他失败或异常",
    "9dt2": "开机失败",
    "9dt3": "非固定命令dt0000",
    "9dta": "下位机无法识别的命令",
    "9dtb": "[占用]卡住了",
    "9dtc": "下位机操作链接超时",
    "9dtd": "底层端口或串口被占用",
    "9dte": "上位机内部异常",
    #
    "9dd0": "关机成功",
    "9dd1": "[兼容异常]其他失败或异常",
    "9dd2": "关机失败",
    "9dd3": "非固定命令dd0000",
    "9dda": "下位机无法识别的命令",
    "9ddb": "[占用]卡住了",
    "9ddc": "下位机操作链接超时",
    "9ddd": "底层端口或串口被占用",
    "9dde": "上位机内部异常",
    #
    "9c00": "自动充电功能启动成功",
    "9c01": "[兼容异常]其他失败或异常",
    "9c02": "启动失败",
    "9c03": "非固定命令c10000",
    "9c04": "不支持自动化充电功能",
    "9c0a": "下位机无法识别的命令",
    "9c0b": "[占用]卡住了",
    "9c0c": "下位机操作链接超时",
    "9c0d": "底层端口或串口被占用",
    "9c0e": "上位机内部异常",
    #
    "9c10": "关闭充电功能启动成功",
    "9c11": "[兼容异常]其他失败或异常",
    "9c12": "关闭失败",
    "9c13": "非固定命令c10000",
    "9c14": "不支持自动化充电功能",
    "9c1a": "下位机无法识别的命令",
    "9c1b": "[占用]卡住了",
    "9c1c": "下位机操作链接超时",
    "9c1d": "底层端口或串口被占用",
    "9c1e": "上位机内部异常",
    #
    "9cp0": "充电成功",
    "9cp1": "[兼容异常]其他失败或异常",
    "9cp2": "充电失败",
    "9cp3": "非固定命令cp0000",
    "9cpa": "下位机无法识别的命令",
    "9cpb": "[占用]卡住了",
    "9cpc": "下位机操作链接超时",
    "9cpd": "底层端口或串口被占用",
    "9cpe": "上位机内部异常",
    #
    "9ck0": "检测成功",
    "9ck1": "[兼容异常]其他失败或异常",
    "9ck2": "检测失败",
    "9ck3": "非固定命令ck0000",
    "9cka": "下位机无法识别的命令",
    "9ckb": "[占用]卡住了",
    "9ckc": "下位机操作链接超时",
    "9ckd": "底层端口或串口被占用",
    "9cke": "上位机内部异常",
    #
    "9sb0": "待机成功",
    "9sb1": "[兼容异常]其他失败或异常",
    "9sb2": "待机失败",
    "9sb3": "非固定命令sb0000",
    "9sba": "下位机无法识别的命令",
    "9sbb": "[占用]卡住了",
    "9sbc": "下位机操作链接超时",
    "9sbd": "底层端口或串口被占用",
    "9sbe": "上位机内部异常"

}

'''
应答码及其对应含义常量配置信息
'''


class ResultCodeDict(object):
    def __init__(self):
        self.init()

    def init(self):
        global result_code_dict
        # 如果想特殊处理，在初始化中追加
        return

    def get(self, key):
        return result_code_dict.get(key)

    def get_msg(self, key):
        key_length = len(key)
        key_str = key
        if key_length < 4:
            return "应答码应该大于等于4位"
        elif key_length > 4:
            key_str = key[key_length - 4:key_length]
            # print(key)
        msg = result_code_dict.get(key_str)
        if msg is None:
            if key_str.startswith("9"):
                if key_str.endswith("0"):
                    return "通用-成功"
                elif key_str.endswith("1"):
                    return "通用-发生未知异常"
                elif key_str.endswith("a"):
                    return "通用-下位机无法识别命令"
                elif key_str.endswith("b"):
                    return "通用-硬件卡主了"
                elif key_str.endswith("c"):
                    return "通用-下位机操作链接超时"
                elif key_str.endswith("d"):
                    return "通用-底层端口或串口被占用"
                elif key_str.endswith("e"):
                    return "通用-上位机内部异常"
                else:
                    return f"应答码{key}未找到对应通用含义"
            else:
                return f"应答码{key}未找到对应含义"
        return msg


if __name__ == "__main__":
    r = ResultCodeDict()
    # print(type(r))
    # print(r.get("9140"))
    # print("==========")
    # print(r.get_msg("9140"))
    # print("==========")
    # print(r.get_msg("1234569141"))
    # print("==========")
    # print(r.get_msg("123456aaaa"))
    # print("==========")
    # print(r.get_msg("1234569xx0"))
    # print("==========")
    # print(r.get_msg("1234569xxz"))
    # print("==========")
    aa = [['11', '22', '33']]
    print(len(aa[0]))
    print(len(aa[0][1]))
    config = Config()
    configinfo_list = config.getconfiginfo()  # 列表元组的形式
    print(configinfo_list[0][1])
    print(len(configinfo_list[0]))